cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "caskroom/fonts"

brew "git"
brew "zsh"
brew "ag"
brew "ruby"
brew "tree"
brew "jq"
brew "vim", args: ["--with-override-system-vi"]
brew "mysql"
brew "postgresql"
brew "sqlite"
brew "zsh-autosuggestions"
brew "node"
brew "terraform"
brew "zsh-syntax-highlighting"
brew "nvm"
brew "python"
brew "terraform_landscape"
brew "awscli"
brew "gettext"
brew "python3"
brew "openssl"
brew "git-crypt"
brew "wget"
brew "rancher-compose"
brew "embulk"
brew "htop"
brew "mackup"
brew "git-extras"
brew "legit"
brew "tree"

cask "font-source-code-pro"
cask "1Password"
cask "google-chrome"
cask "firefox"
cask "slack"
cask "spotify"
cask "alfred"
cask "dbeaver-enterprise"
cask "evernote"
cask "java"
cask "postman"
cask "slate"
cask "teamsql"
cask "wkhtmltopdf"
cask "docker"
cask "karabiner-elements"
cask "skype"
cask "vagrant"
cask "chefdk"
cask "dropbox"
cask "sublime-text"
cask "virtualbox"
cask "mou"
cask "vlc"
cask "skype"
cask "qlmarkdown"
cask "qlstephen"
cask "suspicious-package"